In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
index = [1, 2, 3]
names = ['Hisham', 'Khalid', 'Mohammed']
s2 = pd.Series(names, index=index)
s2

1      Hisham
2      Khalid
3    Mohammed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
# change the indexes
s2.index = [11,12,13]
s2

11      Hisham
12      Khalid
13    Mohammed
dtype: object

## Q3: Retrieve First and second elements.

In [7]:
s2[:2]

11    Hisham
12    Khalid
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [9]:
y = pd.Series(['Saad', 'Saad'])
z = pd.concat([s2, y])
z

11      Hisham
12      Khalid
13    Mohammed
0         Saad
1         Saad
dtype: object

In [12]:
z.drop_duplicates(inplace=True)
z

11      Hisham
12      Khalid
13    Mohammed
0         Saad
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [14]:
Students = pd.DataFrame(columns=['ID', 'NAME', 'GPA'])
Students

Empty DataFrame
Columns: [ID, NAME, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [16]:
edu = pd.read_csv(r'C:\Users\20his\Desktop\EX\Lectures\6-pandas\educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [17]:
edu.loc[edu['Flag and Footnotes']=='e']

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
...,...,...,...,...,...
79,2007,Euro area (13 countries),Total public expenditure on education as % of ...,4.8,e
80,2008,Euro area (13 countries),Total public expenditure on education as % of ...,4.94,e
81,2009,Euro area (13 countries),Total public expenditure on education as % of ...,5.32,e
82,2010,Euro area (13 countries),Total public expenditure on education as % of ...,5.28,e
83,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.15,e

In [18]:
edu.iloc[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e